jykim0120/STM32_VB8HD_GIT/VB8HD___MDIN340_AHD20/Hdmirx/HDRx_registers.h
#define REG_RX_BSTATUSL 0xD5
#define REG_RX_BSTATUSH 0xD6
    #define B_CAP_HDMI_MODE (1<<12)
    #define B_CAP_DVI_MODE (0<<12)
    #define B_MAX_CASCADE_EXCEEDED  (1<<11)
    #define M_REPEATER_DEPTH    (0x7<<8)
    #define O_REPEATER_DEPTH    8
    #define B_DOWNSTREAM_OVER   (1<<7)
    #define M_DOWNSTREAM_COUNT  0x7F
#define REG_RX_SHA1_H00 0xD7
#define REG_RX_SHA1_H01 0xD8
#define REG_RX_SHA1_H02 0xD9
#define REG_RX_SHA1_H03 0xDA
#define REG_RX_SHA1_H10 0xDB
#define REG_RX_SHA1_H11 0xDC
#define REG_RX_SHA1_H12 0xDD
#define REG_RX_SHA1_H13 0xDE
#define REG_RX_SHA1_H20 0xDF
#define REG_RX_SHA1_H21 0xE0
#define REG_RX_SHA1_H22 0xE1
#define REG_RX_SHA1_H23 0xE2
#define REG_RX_SHA1_H30 0xE3
#define REG_RX_SHA1_H31 0xE4
#define REG_RX_SHA1_H32 0xE5
#define REG_RX_SHA1_H33 0xE6
#define REG_RX_SHA1_H40 0xE7
#define REG_RX_SHA1_H41 0xE8
#define REG_RX_SHA1_H42 0xE9
#define REG_RX_SHA1_H43 0xEA
#define REG_RX_M0_B0 0xEB
#define REG_RX_M0_B1 0xEC
#define REG_RX_M0_B2 0xED
#define REG_RX_M0_B3 0xEE
#define REG_RX_M0_B4 0xEF
#define REG_RX_M0_B5 0xF0
#define REG_RX_M0_B6 0xF1
#define REG_RX_M0_B7 0xF2

///////////////////////////////////////////////////////////
// mode uc type and structure
///////////////////////////////////////////////////////////

#define CAPS_MIN_PROGRESS_VFREQ 2300  // 23Hz
#define CAPS_MAX_PROGRESS_VFREQ 10000 // 100Hz
#define CAPS_MIN_PROGRESS_HFREQ 300   // 30.0 KHz
#define CAPS_MAX_PROGRESS_HFREQ 1000  // 100.0 KHz
#define CAPS_MIN_INTERLACE_VFREQ 2500 // 25Hz
#define CAPS_MAX_INTERLACE_VFREQ 6000 // 55Hz
#define CAPS_MIN_INTERLACE_HFREQ 150  // 15.0 KHz
#define CAPS_MAX_INTERLACE_HFREQ 550  // 60.0 KHz

//typedef struct _Sync_Info {
//    USHORT HRes, VRes ;
//    SHORT VFreq ; // in 0.01Hz unit
//    USHORT HTotal, VTotal ;
//    USHORT PCLK ; // in 100KHz unit
//    BYTE PixelRep ;
//    BYTE Mode ; // D[0] - interlace
//} SYNC_INFO, *PSYNC_INFO ;
//

//#define F_MODE_INTERLACE  (1<<0)
//#define F_MODE_RGB24  (0<<1)
//#define F_MODE_YUV422 (1<<1)
//#define F_MODE_YUV444 (2<<1)
//#define F_MODE_CLRMOD_MASK (3<<1)
//#define F_MODE_ITU709  (1<<3)
//#define F_MODE_16_235  (1<<4)
//#define F_MODE_EN_UDFILT (1<<5)// output mode only, and loaded from EEPROM
//#define F_MODE_EN_DITHER  (1<<6)// output mode only, and loaded from EEPROM
#define HDMI_RX_I2C_SLAVE_ADDR 0x90

/////////////////////////////////////////
// PC Implementation
/////////////////////////////////////////
// 1. SCL => output => Pin-2,  D0
// 2. SDA-write => output => Pin1, ~C0
// 3. SDA-read => input => Pin15, S3
// 4. ResetN=> output => Pin14, ~C1
// 5. SCDT => input => Pin13, S4
// 6. Vsync => input => Pin12, S5
// 7. INT => input => Pin11, ~S7
/////////////////////////////////////////

#define PORT_PRN_DATA 0x378
#define PORT_PRN_STAT 0x379
#define PORT_PRN_CTRL 0x37A

#define FLAG_CLEAR_INT_MODE 1
#define FLAG_CLEAR_INT_PKG 2
#define FLAG_CLEAR_INT_ECC 4
#define FLAG_CLEAR_INT_AUDIO 8
#define FLAG_CLEAR_INT_MUTECLR (1<<6)
#define FLAG_CLEAR_INT_MUTESET (1<<7)
#define FLAG_CLEAR_INT_ALL  (FLAG_CLEAR_INT_MUTESET|FLAG_CLEAR_INT_MUTECLR|FLAG_CLEAR_INT_MODE|FLAG_CLEAR_INT_PKG|FLAG_CLEAR_INT_ECC|FLAG_CLEAR_INT_AUDIO)
#define FLAG_CLEAR_INT_MASK (~FLAG_CLEAR_INT_ALL)

#define FLAG_CLEAR_INT_HDCP (1<<7)

#ifndef _MCU_8051_
/////////////////////////////////////////
// PC Implementation
/////////////////////////////////////////
// 1. SCL => output => Pin-2,  D0
// 2. SDA-write => output => Pin1, ~C0
// 3. SDA-read => input => Pin15, S3
// 4. ResetN=> output => Pin14, ~C1
// 5. SCDT => input => Pin13, S4
// 6. Vsync => input => Pin12, S5
// 7. INT => input => Pin11, ~S7
/////////////////////////////////////////

#define PORT_PRN_DATA 0x378
#define PORT_PRN_STAT 0x379
#define PORT_PRN_CTRL 0x37A
#endif



#define B_CAP_AUDIO_ON  (1<<7)
#define B_CAP_HBR_AUDIO (1<<6)
#define B_CAP_DSD_AUDIO (1<<5)
#define B_LAYOUT        (1<<4)
#define B_MULTICH       (1<<4)
#define B_HBR_BY_SPDIF  (1<<3)
#define B_SPDIF         (1<<2)
#define B_CAP_LPCM      (1<<0)

#define Switch_HDMIRX_Bank(x)	HDRX_RegWrite(0x0f,(x)&1)

#define CAT_HDMI_PORTA 0
#define CAT_HDMI_PORTB 1
#define HDMIRX_MAX_KSV 6

#define VIDEO_OFF   0
#define VIDEO_ON    1
#define VIDEO_AUTO  2

#endif // _HDMIRX_H_
